/****************************************Copyright (c)****************************************************
**                               Guangzhou ZHIYUAN electronics Co.,LTD.
**                                     
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:                LCD_Test.c
** Last modified Date:       2010-03-04
** Last Version:             
** Description:              ¹¦ÄÜ£ºLCD STC²âÊÔ³ÌÐò
**                      
** 
**--------------------------------------------------------------------------------------------------------
** Created By:               He Zengfu
** Created date:             2010-06-22
** Version:                  V1.0
** Descriptions: 
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/

/*********************************************************************************************************
**°üº¬µÄÍ·ÎÄ¼þ
*********************************************************************************************************/
#include <reg52.h>
#include <string.h>
#include <math.h>

/*********************************************************************************************************
**±äÁ¿¶¨Òå
*********************************************************************************************************/
sbit  BELL  =P1^4;
sbit  POWER = P1^5;
sbit  LIGHT  =P1^6;
int   KeyFlag = 0; 

/***************************************************************************
**Íâ²¿º¯ÊýÉùÃ÷
***************************************************************************/

extern void InitLCD(void);
extern void send_data(int dat);


extern void write_str(unsigned char x,  unsigned char y,unsigned char *str);

extern void Keytest(void);

extern LCD_RST;
extern void	    get_data();
extern void		display1();
extern void     get_time();
extern void		display2();
extern void 	time0();
extern void     time1();
extern char sec;
/*********************************************************************************************************
** Function name:       delay
** Descriptions:        ¶¨ÒåÑÓÊ±º¯Êý
** input parameters:    dly£º¾ö¶¨ÁËÑÓÊ±µÄ´óÐ¡
**
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void delay(long dly)
{
     int i=0;
	 for(i=0;i<dly;i++)
	 {
	 	
	 }
}

/*********************************************************************************************************
** Function name:       BELL_ON
** Descriptions:        ·äÃùÆ÷·¢Éùº¯Êý
** input parameters:    Time£º¾ö¶¨ÁË·äÃùÆ÷Ãû½ÐµÄÊ±¼ä
**
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/void BELL_ON(int Time)
{
	BELL=0;
		delay(200);
		BELL=1;
		delay(Time);
		BELL=0;
}

/*********************************************************************************************************
** Function name:       main
** Descriptions:        Ö÷º¯Êý£¨³ÌÐòµÄÈë¿Ú£©
** input parameters:    NONE
**
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void main()
{ 
   
    TMOD=0x01;
	TH0=0xfc;
	TL0=0x66;
	EA=1;
	ET0=1;
	TR0=1;                       

	P0=0xff;
	P1=0xff;
	delay(5000);//                                                                                          

	P2=0xf0;   /*?*/                                                 //0~3Êä³ö4~7ÊäÈë
	BELL=0;
	POWER=0;
	LIGHT=1;
	InitLCD();                                                       //ÎÞ³õÊ¼»¯Ê±ÖÓ²»×ß×ß*
    delay(2000);

	send_data(0xf4);
    while(1)
	 {

		get_data();
		display1();
		get_time();
		display2();
        delay(10000);
       // sec++;/*ÏÈ°ÑÖÐ¶Ï¹ØÁËÔÙ²âÊÔÃëÊÇ·ñ×ß³ö*/Ä
     }
		

}

void time0(void) interrupt 1 using 1
{
	TH0=0xfc;
	TL0=0x66;
	time1();
}

/*********************************************************************************************************
** End  File
*********************************************************************************************************/
