#include<reg52.h>
#include"18B20.h"
#include"lcd.h"
/*******************************************************************************
* º¯ Êı Ãû         : Delay1ms
* º¯Êı¹¦ÄÜ		   : ÑÓÊ±º¯Êı
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void Delay1ms(uint y)
{
	uint x;
	for( ; y>0; y--)
	{
		for(x=110; x>0; x--);
	}
}
/*******************************************************************************
* º¯ Êı Ãû         : Ds18b20Init
* º¯Êı¹¦ÄÜ		   : ³õÊ¼»¯
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ³õÊ¼»¯³É¹¦·µ»Ø1£¬Ê§°Ü·µ»Ø0
*******************************************************************************/

uchar Ds18b20Init()
{
	uchar i;
	DSPORT = 0;			 //½«×ÜÏßÀ­µÍ480us~960us
	i = 70;	
	while(i--);//ÑÓÊ±642us
	DSPORT = 1;			//È»ºóÀ­¸ß×ÜÏß£¬Èç¹ûDS18B20×ö³ö·´Ó¦»á½«ÔÚ15us~60usºó×ÜÏßÀ­µÍ
	i = 0;
	while(DSPORT)	//µÈ´ıDS18B20À­µÍ×ÜÏß
	{
		Delay1ms(1);
		i++;
		if(i>5)//µÈ´ı>5MS
		{
			return 0;//³õÊ¼»¯Ê§°Ü
		}
	
	}
	return 1;//³õÊ¼»¯³É¹¦
}

/*******************************************************************************
* º¯ Êı Ãû         : Ds18b20WriteByte
* º¯Êı¹¦ÄÜ		   : Ïò18B20Ğ´ÈëÒ»¸ö×Ö½Ú
* Êä    Èë         : com
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void Ds18b20WriteByte(uchar dat)
{
	uint i, j;

	for(j=0; j<8; j++)
	{
		DSPORT = 0;	     	  //Ã¿Ğ´ÈëÒ»Î»Êı¾İÖ®Ç°ÏÈ°Ñ×ÜÏßÀ­µÍ1us
		i++;
		DSPORT = dat & 0x01;  //È»ºóĞ´ÈëÒ»¸öÊı¾İ£¬´Ó×îµÍÎ»¿ªÊ¼
		i=6;
		while(i--); //ÑÓÊ±68us£¬³ÖĞøÊ±¼ä×îÉÙ60us
		DSPORT = 1;	//È»ºóÊÍ·Å×ÜÏß£¬ÖÁÉÙ1us¸ø×ÜÏß»Ö¸´Ê±¼ä²ÅÄÜ½Ó×ÅĞ´ÈëµÚ¶ş¸öÊıÖµ
		dat >>= 1;
	}
}
/*******************************************************************************
* º¯ Êı Ãû         : Ds18b20ReadByte
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡Ò»¸ö×Ö½Ú
* Êä    Èë         : com
* Êä    ³ö         : ÎŞ
*******************************************************************************/


uchar Ds18b20ReadByte()
{
	uchar byte, bi;
	uint i, j;	
	for(j=8; j>0; j--)
	{
		DSPORT = 0;//ÏÈ½«×ÜÏßÀ­µÍ1us
		i++;
		DSPORT = 1;//È»ºóÊÍ·Å×ÜÏß
		i++;
		i++;//ÑÓÊ±6usµÈ´ıÊı¾İÎÈ¶¨
		bi = DSPORT;	 //¶ÁÈ¡Êı¾İ£¬´Ó×îµÍÎ»¿ªÊ¼¶ÁÈ¡
		/*½«byte×óÒÆÒ»Î»£¬È»ºóÓëÉÏÓÒÒÆ7Î»ºóµÄbi£¬×¢ÒâÒÆ¶¯Ö®ºóÒÆµôÄÇÎ»²¹0¡£*/
		byte = (byte >> 1) | (bi << 7);						  
		i = 4;		//¶ÁÈ¡ÍêÖ®ºóµÈ´ı48usÔÙ½Ó×Å¶ÁÈ¡ÏÂÒ»¸öÊı
		while(i--);
	}				
	return byte;
}
/*******************************************************************************
* º¯ Êı Ãû         : Ds18b20ChangTemp
* º¯Êı¹¦ÄÜ		   : ÈÃ18b20¿ªÊ¼×ª»»ÎÂ¶È
* Êä    Èë         : com
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void  Ds18b20ChangTemp()
{
	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteByte(0xcc);		//Ìø¹ıROM²Ù×÷ÃüÁî		 
	Ds18b20WriteByte(0x44);	    //ÎÂ¶È×ª»»ÃüÁî
//	Delay1ms(100);	//µÈ´ı×ª»»³É¹¦£¬¶øÈç¹ûÄãÊÇÒ»Ö±Ë¢×ÅµÄ»°£¬¾Í²»ÓÃÕâ¸öÑÓÊ±ÁË
   
}
/*******************************************************************************
* º¯ Êı Ãû         : Ds18b20ReadTempCom
* º¯Êı¹¦ÄÜ		   : ·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
* Êä    Èë         : com
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void  Ds18b20ReadTempCom()
{	

	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteByte(0xcc);	 //Ìø¹ıROM²Ù×÷ÃüÁî
	Ds18b20WriteByte(0xbe);	 //·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
}
/*******************************************************************************
* º¯ Êı Ãû         : Ds18b20ReadTemp
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡ÎÂ¶È
* Êä    Èë         : com
* Êä    ³ö         : ÎŞ
*******************************************************************************/

int Ds18b20ReadTemp()
{
	int temp = 0;
	uchar tmh, tml;
	Ds18b20ChangTemp();			 	//ÏÈĞ´Èë×ª»»ÃüÁî
	Ds18b20ReadTempCom();			//È»ºóµÈ´ı×ª»»Íêºó·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
	tml = Ds18b20ReadByte();		//¶ÁÈ¡ÎÂ¶ÈÖµ¹²16Î»£¬ÏÈ¶ÁµÍ×Ö½Ú
	tmh = Ds18b20ReadByte();		//ÔÙ¶Á¸ß×Ö½Ú
	temp = tmh;
	temp <<= 8;
	temp |= tml;
	return temp;
}









/*nsigned char Time0[9],week[3],week0,DisplayData[8], Data0[5],ADData[8];
/*unsigned char code Seg_Data[]={	 //the information is showed in the digital tube,shows 0-F//¹²ÑôÊıÂë¹ÜµÄ±àÂë£¬²¢½«Êı¾İ¶¨ÒåÔÚCODEÇø 
					        0xc0,/*0*/
//					        0xF9,/*1*/
//				        0xA4,/*2*/
//				        0xB0,/*3*/
//				        0x99,/*4*/
//				        0x92,/*5*/
//0x82,/*6*/
	//				        0xF8,/*7*/
		//			        0x80,/*8*/
			//		        0x90,/*9*/				
					
/*							};
	LcdDisplayTemp0(Ds18b20ReadTemp());//ÏÔÊ¾ÎÂ¶È
void LcdDisplayTemp0(int temp) 	 //lcdÏÔÊ¾
{
	unsigned char i; 
	unsigned char code  p2[]= "TEMP:";
   	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
		DisplayData[0] = 0x40; 
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else
  	{			
		DisplayData[0] = 0x00;
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	//P3=tp;

	Data0[0] = temp / 10000;
	Data0[1] = temp % 10000 / 1000;
	Data0[2] = temp % 1000 / 100 ;
	Data0[3] = temp % 100 / 10;
	Data0[4] = temp % 10;
  
	for(i=0;i<=4;i++)
	{
		switch(Seg_Data[Data0[i]])
		{
			case 0xc0:
			{T[i]=0x30;break;}
			case 0xF9:
			{T[i]=0x31;break;}
			case 0xA4:
			{T[i]=0x32;break;}
			case 0xB0:
			{T[i]=0x33;break;}
			case 0x99:
			{T[i]=0x34;break;}
			case 0x92:
			{	T[i]=0x35;break;}
			case 0x82:
			{	T[i]=0x30;break;}
			case 0xF8:
			{T[i]=0x36;break;}
			case 0x80:
			{T[i]=0x37;break;}
			case 0x90:
			{T[i]=0x38;break;}			
		}
	}
		   LCD1602_WriteInformation(0x01,0);	//ÇåÆÁÖ¸Áî
	LCD1602_MoveToPosition(0,0);
           LCD1602_DisplayString(p2);
			 LCD1602_DisplayOneCharOnAddr(0,6,T[1]);
	  	LCD1602_DisplayOneCharOnAddr(0,7,T[2]);
	  	LCD1602_DisplayOneCharOnAddr(0,8,0x2e);//.
	  	LCD1602_DisplayOneCharOnAddr(0,9,T[3]);
       LCD1602_DisplayOneCharOnAddr(0,10,0x06);	//¡ãc
}*/